#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2423734833]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eventbridge.aws_cloudwatch_event_bus.this[0] will be created
  + resource "aws_cloudwatch_event_bus" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "traffic-event-bus-dev"
      + tags     = {
          + "Name" = "traffic-event-bus-dev"
        }
      + tags_all = {
          + "CreatedAt" = "2022-07-12"
          + "ManagedBy" = "Terraform"
          + "Name"      = "traffic-event-bus-dev"
          + "Owner"     = "Marlon Souza"
          + "Project"   = "TF Ecosystem"
        }
    }

  # module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "traffic-event-bus-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "traffic-event-bus-dev"
        }
      + tags_all              = {
          + "CreatedAt" = "2022-07-12"
          + "ManagedBy" = "Terraform"
          + "Name"      = "traffic-event-bus-dev"
          + "Owner"     = "Marlon Souza"
          + "Project"   = "TF Ecosystem"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "instance_type" but a value
was found in file "../enviroments/aws/terraform.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marlonsouza, Action: `pull_request`, Working Directory: ``, Workflow: `Create terraform plan`*